#Напишите программу, которая генерирует и выводит таблицу квадратов чисел от 1 до 20. Используйте цикл for.

for i in range(1, 21):
    x = i**1
    print(i, x)